/**
 * 70.锟斤拷楼锟斤拷
 * 锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷楼锟捷★拷锟斤拷要 n?锟斤拷锟斤拷锟斤拷艿锟斤拷锟铰ワ拷锟斤拷锟?
 * <p>
 * 每锟斤拷锟斤拷锟斤拷锟斤拷锟?1 锟斤拷 2 锟斤拷台锟阶★拷锟斤拷锟叫讹拷锟斤拷锟街诧拷同锟侥凤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷楼锟斤拷锟截ｏ拷
 * <p>
 * 注锟解：锟斤拷锟斤拷 n 锟斤拷一锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷
 * <p>
 * 示锟斤拷 1锟斤拷
 * <p>
 * 锟斤拷锟诫： 2
 * 锟斤拷锟斤拷锟?2
 * 锟斤拷锟酵ｏ拷 锟斤拷锟斤拷锟街凤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷楼锟斤拷锟斤拷
 * 1.  1 锟斤拷 + 1 锟斤拷
 * 2.  2 锟斤拷
 * 示锟斤拷 2锟斤拷
 * <p>
 * 锟斤拷锟诫： 3
 * 锟斤拷锟斤拷锟?3
 * 锟斤拷锟酵ｏ拷 锟斤拷锟斤拷锟街凤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷楼锟斤拷锟斤拷
 * 1.  1 锟斤拷 + 1 锟斤拷 + 1 锟斤拷
 * 2.  1 锟斤拷 + 2 锟斤拷
 * 3.  2 锟斤拷 + 1 锟斤拷
 * <p>
 * 锟斤拷源锟斤拷锟斤拷锟桔ｏ拷LeetCode锟斤拷
 * 锟斤拷锟接ｏ拷https://leetcode-cn.com/problems/climbing-stairs
 * 锟斤拷锟斤拷权锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷小锟斤拷锟揭底拷锟斤拷锟斤拷锟较碉拷俜锟斤拷锟饺拷锟斤拷锟斤拷锟揭底拷锟斤拷锟阶拷锟斤拷锟斤拷锟斤拷锟?
 * <p>
 * 锟斤拷锟斤拷思路锟斤拷斐诧拷锟斤拷锟斤拷锟斤拷锟斤拷
 **/

//Java 
//- * - coding锟斤拷utf-8 - * -
//Author:JoeyChen
//Data:2020/04/23

//锟斤拷锟斤拷一锟斤拷锟斤拷态锟芥划

/**
 锟斤拷锟斤拷思路锟斤拷斐诧拷锟斤拷锟斤拷锟斤拷锟斤拷
 **/

/**
 执锟叫斤拷锟斤拷锟?
 执锟斤拷锟斤拷时 :0 ms, 锟斤拷锟斤拷锟斤拷 Java 锟结交锟叫伙拷锟斤拷锟斤拷100.00%锟斤拷锟矫伙拷
 锟节达拷锟斤拷锟斤拷 :36 MB, 锟斤拷锟斤拷锟斤拷 Java 锟结交锟叫伙拷锟斤拷锟斤拷5.66%锟斤拷锟矫伙拷
 **/

class Solution {
    public int climbStairs(int n) {
        //锟斤拷态锟芥划 锟洁当锟斤拷 斐诧拷锟斤拷锟斤拷锟斤拷锟斤拷
        if (n == 1) return 1;
        if (n == 2) return 2;
        int[] dp = new int[n];
        dp[0] = 1;
        dp[1] = 2;

        for (int i = 2; i < n; i++) {
            dp[i] = dp[i - 1] + dp[i - 2];
        }
        return dp[n - 1];

    }
}